{
  "show_name": "CNN NEWSROOM",
  "show_title": "Markets Close Higher In Asia; European Markets Look To Extend Gains; Trump Spars With Univision Anchor; Anti-immigrant Rhetoric Propels Trump; Momentum Building For Biden Presidential Run; Merkel To Visit Site Of Anti-Refugee Protests; Thousands Of Migrants Making Their Way Across Europe; Train Attack Suspect Faces Multiple Terror Charges; Sideline Diplomatic Talks At Russian Air Show. Aired 3-4a ET",
  "candidates_mentioned": [
    "sanders",
    "clinton",
    "trump"
  ],
  "candidates_quoted": [
    "sanders"
  ],
  "quotes": [
    {
      "speaker": "ERROL BARNETT, CNN ANCHOR",
      "text": "Live pictures for you as Europe's trading day begins.  Stocks in Asia appear to have stabilized following days of heavy losses."
    },
    {
      "speaker": "ROSEMARY CHURCH, CNN ANCHOR",
      "text": "Plus German Chancellor Angela Merkel heads to the scene of those violent anti-refugee protests."
    },
    {
      "speaker": "DONALD TRUMP (R), PRESIDENTIAL CANDIDATE",
      "text": "Excuse me, sit down, you weren't called.  Sit down."
    },
    {
      "speaker": "BARNETT",
      "text": "Donald Trump gets a reporter tossed out of a campaign event."
    },
    {
      "speaker": "CHURCH",
      "text": "Hello and welcome to viewers here in the United States and of course, all around the world.  I'm Rosemary Church."
    },
    {
      "speaker": "BARNETT",
      "text": "And I'm Errol Barnett.  Thanks for being with us.  This is CNN NEWSROOM."
    },
    {
      "speaker": "CHURCH",
      "text": "And we begin with the global financial markets after two days of heavy losses.  Stocks are closing higher for the most part in Asia."
    },
    {
      "speaker": "BARNETT",
      "text": "And this is welcome news.  It's a bit of a turnaround (video out) live in London with a look at that momentarily."
    },
    {
      "speaker": "CHURCH",
      "text": "But let's start with Anna Coren who is watching Asian markets in Hong Kong.  Ana, what a difference a day makes when you look at the numbers, it appears for the most part that China's intervention has made the difference."
    },
    {
      "speaker": "ANNA COREN, CNN CORRESPONDENT",
      "text": "Well, it depends on who you speak to, Rosemary, and how this is actually interpreted considering the moves that the central bank in China made last night to cut the reserve requirement ratio, which is the money that the bank has to set aside. These are not the significant gains that, perhaps, Chinese authorities were hoping for.  Remember that over the past two days, the Shanghai Composite dropped 15 percent.  So, really, perhaps they would have been hoping for much more than what we are seeing and right now as the Shanghai Composite closes it is down more than more than 0.5 percent. So really this is not particularly good news considering the moves that they have taken.  This has been interpreted as a rather lukewarm response by the markets. And perhaps, you know, not enough to restore the confidence and stimulate the growth and just really stabilize the volatility, which we have seen over the past few days. So really, it depends on who you speak to, Rosemary, but I think there are a lot of people out there who would say the Chinese government has not done enough.  This is merely a temporary measure and it will need to do a lot more in the coming weeks and months to see real change."
    },
    {
      "speaker": "CHURCH",
      "text": "All right.  We'll see whether China's intervention does help to stimulate the economy down the track.  Anna Coren reporting there live from Hong Kong, many thanks to you."
    },
    {
      "speaker": "BARNETT",
      "text": "Let's quickly jump over to our Isa Soares standing by in London.  Isa, the German, Italian and French stocks rebounded yesterday after a very shaky start as did the FTSE in London.  Why was that and can we expect the same today?"
    },
    {
      "speaker": "ISA SOARES, CNN CORRESPONDENT",
      "text": "I think that really there is a question here, Errol of really chasing tail spin, who is chasing who though you don't know if they are looking at Asia or looking in the U.S.  It pretty much went in their own direction. I think we had a very strong data yesterday out of Europe that really helped to lift sentiment.  We had data out of Germany.  We also had GDP data out of Germany, all very strong.  That helped to boost European markets. But let's have a look how your pre-markets are faring because I'm expecting from the notes I've been reading prior from investors expecting to be a soggy start to be honest with you.  It is pretty soggy. Numbers down quite substantially even though we saw those muted numbers out of Asia.  The Nikkei, the Shanghai not doing too badly, pretty flat, but you would have expected a bit of more of a turnaround given the moves that we've seen from China. But it's going to the same point that Anna was making there.  You don't know just how much of what the Chinese government has done, how much is just window dressing, to be completely honest.  The feeling is they've done something, but clearly that is not enough to really persuade investors to go all in.  Look at those numbers, down 2 percent.  We had numbers up to as much as 4 percent yesterday. So the celebration, that's gone out of the window for European investors, clearly concerned about growth in China and clearly wanting China to do more.  China's cut rates five times already, but can it do more? It has the means to do more, but is it willing to do enough to convince investors this is really important.  And what is important as well to point out here is that this is very light trading.  This is summer, many people on holiday. So there is an aspect of that and another aspect is also herd mentality, as you know.  A lot of the trades are done by computers. So it really is hard to figure out who exactly they're being led by. Just being led by Asia, being led by the U.S. because we know the U.S. ended down.  So there is that element of herd mentality in this.  And I think it's hard to find out exactly how traders are feeling. When we come to September, though, I think we have a better sense of exactly the mood for traders.  But Asia nevertheless still is number one concern for many traders I have been speaking to \n Errol."
    },
    {
      "speaker": "BARNETT",
      "text": "It's a mixed picture when we look at financial markets.  We appreciate you walking us through it.  Anna Coren in Hong Kong and Isa Soares live for us in London.  Thanks to you both."
    },
    {
      "speaker": "CHURCH",
      "text": "All right, let's turn to U.S. politics now and Republican presidential candidate, Donald Trump, is involved in a war of words with yet another TV journalist."
    },
    {
      "speaker": "BARNETT",
      "text": "This time around he had a fiery clash with Univision anchor, Jorge Ramos.  Trump was holding a press conference in Iowa when Ramos, a Mexican-American journalist tried to ask a question about the candidate's immigration policies."
    },
    {
      "speaker": "(VIDEO OUT) BARNETT",
      "text": "Republican strategist, Alex Castellanos, joins us now from Washington, D.C. to talk about all of this.  And Alex, like him or not, Donald Trump is proving himself to be a completely different kind of campaigning politician. He may be great TV, but is he really good for the Republican Party? He is speaking off the cuff even insulting one particular female conservative news anchor.  Is that really good for what conservatives want to accomplish? ALEX CASTELLANOS, FOUNDER OF NEWREPUBLICAN."
    },
    {
      "speaker": "COM",
      "text": "No.  It's good for what Donald Trump may want to accomplish, but he is not really a Republican.  He is probably not a Democrat.  He is all about more power for Donald Trump.  He doesn't give you any specifics about his plans just trust him. Donald Trump is a little bit like fire.  He can cook your food or he can burn your house down with everyone in it.  Just give him the power to fix everything and it's going to be just great."
    },
    {
      "speaker": "BARNETT",
      "text": "Well, that makes the stakes pretty high then, right?"
    },
    {
      "speaker": "CASTELLANOS",
      "text": "That's right."
    },
    {
      "speaker": "BARNETT",
      "text": "There was one incident we witnessed where he temporarily removed Univision anchor, Jorge Ramos, before allowing him back in and getting into a testy exchange with him.  The Republicans will need Latino and Hispanic support if they are to win in 2016. How do you think this incident and Trump's vague answer about the wall and his plans to deport millions of illegal immigrants, how do you think that's going to play in the long term with that demo?"
    },
    {
      "speaker": "CASTELLANOS",
      "text": "Well, if Trump becomes the Republican nominee it won't play well with that demo.  Generally people that you want to deport don't want to vote for you.  But if Trump is not the nominee it won't have that much of an impact on the Republican Party. Donald Trump is a unique thing.  He is so different than your standard politician, Republican or Democrat that if he is defeated, if he does not get the nomination, he will take Trumpism with him. Trumpism is not transferrable to any other human being on this planet. So I think whoever gets the Republican nomination, if it's not Trump, will be an anti-Trump and it will be a better day for the Republican Party."
    },
    {
      "speaker": "BARNETT",
      "text": "But today he is number one and has been for weeks in the polls when it comes to Republican voters and his anti-immigrant rhetoric has only served to propel him.  I mean, what does that say about the stake of the Republican Party?"
    },
    {
      "speaker": "CASTELLANOS",
      "text": "I'm not sure that it's as much as anti-immigrant rhetoric.  That's a big part of this certainly, but the reason Republicans are turning to Donald Trump is his strength, which is also the scary side of Donald Trump is his craving for power. Americans and Republicans think that their country is falling apart and we are in decline.  They want someone who is equal to our fears, someone big and that's Donald Trump.  So I think you know, that's what you saw tonight. He's not taking any guff from any news media type like Ramos.  He is telling you what he's going to do.  He's a political strongman.  And when countries are desperate, they turn to the political strongman.  I don't think that's a good thing."
    },
    {
      "speaker": "BARNETT",
      "text": "We will certainly see how this all shapes up.  And we shall note Alex Castellanos wrote an opinion piece on CNN.com.  It's an interesting read.  Thanks so much for your time today joining us from D.C."
    },
    {
      "speaker": "CASTELLANOS",
      "text": "Good to be with you."
    },
    {
      "speaker": "CHURCH",
      "text": "Well, Trump appears to be fanning the embers of his feud with Fox News host, Megyn Kelly.  Their first encounter was during the network's Republican presidential debate earlier this month."
    },
    {
      "speaker": "BARNETT",
      "text": "And this week Trump retweeted comments to his followers who called Kelly a bimbo.  Now Fox News is calling for an apology.  Quote, \"Donald Trump's surprise and unprovoked attack on Megyn Kelly during her show last night is unacceptable as it is disturbing.\" This is what Fox News Chairman Roger Ailes said on Tuesday.  He added, quote, \"Donald Trump rarely apologizes although in this case he should.\"  But Trump, as you might expect, is not backing down."
    },
    {
      "speaker": "DONALD TRUMP (R), PRESIDENTIAL CANDIDATE",
      "text": "It's a very small element in my life, Megyn Kelly.  I don't care about Megyn Kelly, but no, I would not apologize.  She should probably apologize to me.  But I just don't care."
    },
    {
      "speaker": "CHURCH",
      "text": "Donald Trump says he's not afraid of U.S. Vice President Joe Biden.  In fact, the GOP frontrunner says it would be fun to run against him."
    },
    {
      "speaker": "BARNETT",
      "text": "This comes as more signs point to a possible 2016 run for Biden.  CNN's Michelle Kosinski has more."
    },
    {
      "speaker": "MICHELLE KOSINSKI, CNN WHITE HOUSE CORRESPONDENT",
      "text": "Back at work after a few weeks of secret meetings and discussions about whether to jump into the presidential race, Vice President Joe Biden flew to Cleveland of former Congressman Louis Stokes. His fourth memorial service in three months including that of his own son, Beau, who had urged his dad to run for president and that question is all the buzz in politics."
    },
    {
      "speaker": "CAMEROTA",
      "text": "Do you think that Vice President Biden is getting into the race?"
    },
    {
      "speaker": "UNIDENTIFIED MALE",
      "text": "Yes, I do."
    },
    {
      "speaker": "KOSINSKI",
      "text": "His opponents have welcomed him mostly.  Clinton's campaign says they are not worried about it.  It's her e-mail controversy that is contributing to the stirring of a support for a Biden run.  And those close to him are telling CNN that is looking more likely than not. The president has given him a green light.  He is planning more with donors, fundraisers, strategists.  There is now super PAC supporting him."
    },
    {
      "speaker": "JOSH EARNEST, WHITE HOUSE PRESS SECRETARY",
      "text": "There is probably no one in American politics today who has  a better understanding of exactly what is required to  mount a successful national presidential campaign."
    },
    {
      "speaker": "KOSINSKI",
      "text": "No question, he has plenty of supporters, fundraising ability and decades of experience.  But could he beat Clinton is the question that worries some Democrats.  The latest Iowa polling shows her with 54 percent of Democratic support, Bernie Sanders 20 percent, and Biden, 11 percent, though, he is not even yet in, and the man Jon Stewart just called, \"The Great Gaffesby.\""
    },
    {
      "speaker": "JON STEWART",
      "text": "Not just blurting  out.  That's a pre-Trump presidential quality."
    },
    {
      "speaker": "KOSINSKI",
      "text": "With a different type of straight talk to rival Trump's sometimes really seems to make headlines for things like impromptu shoulder massages, semi-reluctantly received kisses and quelp."
    },
    {
      "speaker": "JOE BIDEN, VICE PRESIDENT OF THE UNITED STATES",
      "text": "You cannot go to a 7- 11 or Dunkin' Donuts unless you have a slight Indian accent. I'm the vice president of the student body here."
    },
    {
      "speaker": "KOSINSKI",
      "text": "Just too many to choose from to include here.  But the Democrats are treating this possible run, possible challenge to Hillary as, yes \n Michelle Kosinski, CNN, the White House."
    },
    {
      "speaker": "CHURCH",
      "text": "We'll take a very short break here.  But still to come, Europe's migrant crisis is now causing tensions in Germany.  See how the country's leader is addressing a demonstration that turned violent."
    },
    {
      "speaker": "BARNETT",
      "text": "Plus, remember that attack on a high speed train, we are learning more about a desperate struggle last week in which passengers overwhelmed a heavily armed gunman on a high-speed train. Stay with us."
    },
    {
      "speaker": "PEDRAM JAVAHERI, AMS METEOROLOGIST",
      "text": "Good Wednesday morning to you. I'm Pedram Javaheri for CNN Weather Watch.  The southwestern corner and also the four corners region of the United States getting in on some wet weather in fact some strong thunderstorm in the past several hours in the Phoenix area.  More on that in a minute. And also watching a pattern shift in the northwestern portion of the U.S. for some cooler temperatures not only there, but also moving in across much of the eastern half of the country.  It will be short lived, but still worth noting kind of autumn-like feel for some people in the coming few days with Chicago in the mid-20s. Atlanta and Miami closing in on 30 degrees or exceeding that while back towards the west still on the mild side for a few days before the cooling trend gets there. We had a dust storm warning in portions just east of Phoenix in the past several hours.  You know, moisture pushing up towards areas of Flagstaff, Arizona nearly 600 lightning strikes reported near Jacksonville, Florida on the eastern side of Georgia in the past few hours so this is something keep the rumbles going out there. And we do have some wet weather coming in over portions of the Caribbean, the Leeward Islands and the Windward Islands initially going to get on what is Tropical Storm Erika at this point.  We have what is left of Danny ahead of this feature. But this will be beneficial rains and eventually could become a hurricane as it approaches the portion of southern southeastern Florida in the next three to five days so certainly worth noting and for today we'll call for a thunderstorm in the area.  Temperatures in the low 30s there."
    },
    {
      "speaker": "BARNETT",
      "text": "We want to address Europe's migrant crisis now.  German Chancellor Angela Markel will visit a town where anti-refugee protests turned violent over the weekend.  Demonstrators were angry about the arrival of about 250 asylum seekers.  Clashes between protesters and police left 31 officers injured."
    },
    {
      "speaker": "CHURCH",
      "text": "CNN's Ian Lee is following developments from London and joins us live.  So Ian, how is Angela Merkel likely to deal with the violent reaction to these asylum seekers in her country."
    },
    {
      "speaker": "IAN LEE, CNN CORRESPONDENT",
      "text": "Rosemary, we have seen Angela Merkel come out strong against this violence, this wave.  She is going to where the violence took place in Eastern Germany.  We are also seeing the German government say that they're going to respond to this xenophobic violence, very straightforward that it's going to be police, justice and if they catch the people who are responsible for these attacks prison time. The German government says they have no room for this in Germany. That this is a country that is going to take four times the number of asylum seekers by the end of this year as they did last year.  That is 800,000 people. And Germany says they have the room for this, but there is growing discontent with people in Eastern Germany and other parts where you have these shelters that are overflowing people attacking some of these shelters. There have been a number of arson attacks and Angela Merkel addressed these attacks and the perpetrators directly.  Take a listen.  ANGELA MERKEL, GERMAN CHANCELLOR (through translator"
    },
    {
      "speaker": ")",
      "text": "There was an aggressive xenophobic mood that is in no way acceptable.  It's repulsive to see how right-wing extremists and neo-Nazis are voicing they've hatred, but it is just as disgraceful to see how German citizens and children are supporting this by marching along with them."
    },
    {
      "speaker": "LEE",
      "text": "And Angela Merkel has been criticized for being relatively silent previously, but now we are hearing a very firm chancellor there."
    },
    {
      "speaker": "CHURCH",
      "text": "Ian, you are talking about 800,000 asylum seekers to be assimilated into German society.  There is this resistance now.  What is likely going the happen to these asylum seekers?"
    },
    {
      "speaker": "LEE",
      "text": "We are seeing resistance in the eastern part of Germany where there is a lot of unemployment and fewer opportunities.  And ironically there have been people in Western Germany that have said the people in the east were asylum seekers and refugees when the Berlin wall fell down  and they should accept these people. But this is a large number, 800,000, that's the largest in Europe. That's the largest that Europe has received.  So that is going to be the question, what to do with this many, but there are shelters for these people to go to. Germany says they will devote the resources to make sure they are assimilated and they do have a house and a place to stay.  But it is \n it is a growing concern for a number of people in Germany."
    },
    {
      "speaker": "CHURCH",
      "text": "Indeed.  Many thanks to our Ian Lee reporting from London on the situation in Eastern Germany, appreciate it."
    },
    {
      "speaker": "BARNETT",
      "text": "Many of those fleeing violence in their own countries are passing through the Serbian capital, Belgrade."
    },
    {
      "speaker": "CHURCH",
      "text": "It's a city that knows war all too well.  Arwa Damon has been to a park there to hear some of their stories."
    },
    {
      "speaker": "ARWA DAMON, CNN SENIOR INTERNATIONAL CORRESPONDENT",
      "text": "He strums an old Kurdish song.  His wife sits with their 3-month-old in a park in Central Belgrade, turned way station for refugees.  It was his voice that she first fell in love with. We wanted to settle in Turkey.  I was working weddings there, he says, but tensions have started to rise and if they kick anyone out, it will be us.  The sorrowful lyrics about feeling like a foreigner, it's a sentiment that echoes with all here. (on camera"
    },
    {
      "speaker": ")",
      "text": "We met with a group of friends from Iraq who did not want to appear on camera.  One is a 30-year-old teacher.  His students cried when he told them he decided to leave.  Two years ago militias bombed his wedding and killed his 14-year-old brother. Another of his friends is a computer engineer and another is a journalist from the ISIS stronghold of Mosul.  All say the most precious thing they have is Iraq and because of everything they have been through they feel like they are strangers in their own land."
    },
    {
      "speaker": "",
      "text": "For the refugees, the trek is a pendulum of emotions, from elation at the small moments of respite \n to sheer despair. Macedonia after shutting its border for four days finally started facilitating transit for refugees building a makeshift train stop, which brings them to the border of Serbia. Of all the nations they have crossed, this is a population who remembers war and knows too well that in an instant, all can be lost. At the Belgrade Park there are medical stations most of what they are treating are foot injuries for the adults, cough and colds among the children due to the fluctuating weather and rain with no shelter. From here they hope to country to Western Europe.  It's not a journey any wanted to take.  But crisis across the world have resulted in a human tight sweeping across Europe unlike any in recent history. Two years ago, while still in his homeland, he wrote this song.  Don't cry, my mother, he sings, Syria is for my children.  Foreshadowing the impossible choice his family had to make.  Arwa Damon, CNN, Belgrade."
    },
    {
      "speaker": "BARNETT",
      "text": "A show of Russian might in the skies.  What Moscow has for sale and who is buying in a live report coming up."
    },
    {
      "speaker": "CHURCH",
      "text": "Plus hear the chilling first-hand account of a woman whose husband was slashed on a train in an alleged terror attack."
    },
    {
      "speaker": "BARNETT",
      "text": "It is your last half hour of the day with us as you watch CNN NEWSROOM.  I'm Errol Barnett."
    },
    {
      "speaker": "CHURCH",
      "text": "I'm Rosemary Church.  It is time to check the headlines for you this hour. After two days of losses, stocks in Asia, well, look at that that's a mixed picture.  If we look at Shanghai Composite, it finished down 1.25 percent.  Tokyo's Nikkei, though, up 3.2 percent.  Hong Kong's Hang Seng down about a percentage point there. The markets in Europe opened about a half hour ago all in negative territory heading towards and beyond the 2 percent mark.  So we'll keep an eye on that and see the moves there."
    },
    {
      "speaker": "BARNETT",
      "text": "Chairman Chancellor Angela Merkel will visit a town today where anti-refugee protests turned violent over the weekend.  Demonstrators were angry about the arrival of about 250 asylum seekers.  Clashes between protesters and police left 31 offices injured."
    },
    {
      "speaker": "CHURCH",
      "text": "A news conference for U.S. Republican presidential frontrunner Donald Trump turned into a debate with Univision Anchor Jorge Ramos.  The Mexican-American journalist has been critical of Trump's comments on immigration.  Security escorted Ramos out, but he was allowed to return and ask his question."
    },
    {
      "speaker": "BARNETT",
      "text": "Now one of the Americans aboard the Paris-bound train who subdued an alleged terrorist last week is back home in the United States.  Anthony Sadler, you'll see him in the gray sweatshirt, landed in Sacramento, California a short while ago."
    },
    {
      "speaker": "CHURCH",
      "text": "He just returned from Europe where he and two other Americans and a British citizen received France's highest honor for their heroic acts on board that train."
    },
    {
      "speaker": "BARNETT",
      "text": "Now Francois Hollande will award the Legion of Honor to Mark Moogalian, a French-American for his bravery during the attack.  He is hospitalized in France recovering from the injuries he received while trying to subdue the suspect."
    },
    {
      "speaker": "CHURCH",
      "text": "His wife was with her husband on the train during that terrifying incident and earlier she gave CNN an exclusive account of how the event unfolded.  ISABELLE RISACHER-MOOGALIAN, WIFE OF PASSENGER WHO SUBDUED GUNMAN (through translator"
    },
    {
      "speaker": ")",
      "text": "Get out and it's serious.  I looked at his face and he was not kidding.  He looked very intense.  And I was sitting there.  He was facing the door."
    },
    {
      "speaker": "UNIDENTIFIED MALE",
      "text": "Your back."
    },
    {
      "speaker": "RISACHER-MOOGALIAN",
      "text": "My back."
    },
    {
      "speaker": "UNIDENTIFIED MALE",
      "text": "To the gunman?"
    },
    {
      "speaker": "RISACHER-MOOGALIAN",
      "text": "Well, there is a wall.  There we are at the end of the car.  So there is nothing.  I mean, there is the wall behind me.  I didn't see anything coming.  But I saw the tip of a gun, of a \n how do you call that, a Kalashnikov?  I think you called it AK-47."
    },
    {
      "speaker": "UNIDENTIFIED MALE",
      "text": "Yes."
    },
    {
      "speaker": "RISACHER-MOOGALIAN",
      "text": "I saw that and so I knew that it was serious."
    },
    {
      "speaker": "UNIDENTIFIED MALE",
      "text": "How close?"
    },
    {
      "speaker": "RISACHER-MOOGALIAN",
      "text": "I'm not sure.  I would say \n you see this bar right there?  That's it."
    },
    {
      "speaker": "UNIDENTIFIED MALE",
      "text": "A few feet.  Very close?"
    },
    {
      "speaker": "RISACHER-MOOGALIAN",
      "text": "Yes, not even two feet from me, from my head. Then I got up.  I basically said what he told me to do.  I got up and went just a few seats down and sort of crouched down behind a seat and he just went to the guy with the gun.  I didn't see it because I was hidden, but I heard him say \"I got the gun.\""
    },
    {
      "speaker": "UNIDENTIFIED MALE",
      "text": "This was your husband?"
    },
    {
      "speaker": "RISACHER-MOOGALIAN",
      "text": "Yes, it was his voice.  He said \"I got the gun.\" and it was very fast.  A few seconds later I hear a shot, one, maybe two, it was loud.  And then I saw my husband like two seats that way. I mean, very close to me."
    },
    {
      "speaker": "UNIDENTIFIED MALE",
      "text": "Fell to the ground?"
    },
    {
      "speaker": "RISACHER-MOOGALIAN",
      "text": "He fell to the ground.  I was still behind the seat.  So I didn't see the shooter.  My husband told me after that, that he actually took his gun back."
    },
    {
      "speaker": "UNIDENTIFIED MALE",
      "text": "The gunman grabs the gun away from your husband at this point?"
    },
    {
      "speaker": "RISACHER-MOOGALIAN",
      "text": "Yes.  And my husband thought he was going to shoot him again."
    },
    {
      "speaker": "BARNETT",
      "text": "Such a frightening recollection of events there.  Meantime we are learning more about the suspect on the train.  Ayoub El Khazzani faces multi-charges including attempted mass murder.  A French prosecutor says there is clear evidence of terrorist intent. CNN's Jim Bitterman joins us now live from Paris this morning to discuss what we know.  Jim, somehow the suspect expects officials to believe he was only looking to steal money, nothing terror related as he carried 270 rounds of ammunition.  That is hard to believe to say the least."
    },
    {
      "speaker": "JIM BITTERMANN, CNN SENIOR INTERNATIONAL CORRESPONDENT",
      "text": "Absolutely. I don't think the prosecutors are believing it.  That's what his lawyer was claiming that it was just an armed robbery gone bad.  But the fact is that apparently, from what we hear from terrorism experts, people involved in these kinds of attacks over the last few years always claimed it is not terrorism related. They were just trying to commit a simple crime because in France, anyway, the terrorism laws are much stricter.  But the prosecutor yesterday made it clear that he believes they have plenty of evidence to link this to terrorism including something that they found on his cell phone.  Here's more from the prosecutor.  FRANCOIS MOLINS, PARIS PROSECUTOR (through translator"
    },
    {
      "speaker": ")",
      "text": "The internet through his phone showed us that among others, Ayoub El Khazzani was looking at an audio file on YouTube in which an individual was calling his followers to combat."
    },
    {
      "speaker": "BITTERMANN",
      "text": "So basically the prosecutor believes that plus the fact that he was connected with a radical Islamic group down in Spain where he had lived for some time plus the weapons plus the money, all these things, which they're still investigating to some extent, all of these things link him to a terrorist act.  His indictment is under charges linked to terrorism."
    },
    {
      "speaker": "BARNETT",
      "text": "And Jim, considering that it appears that the suspect, Ayoub El Khazzani, spent time in a number of European countries before this attack will the French officials be the only ones to bring charges? It would seem that information from other nations would bolster their terrorism case."
    },
    {
      "speaker": "BITTERMANN",
      "text": "Because the act did occur on French territory that's where the charges will be brought.  There could be other related charges that fall out of this.  In Belgium, for example, they have looked into his sister's apartment where he stayed. There has been an investigation in Spain.  There may be some things there.  But as far as the act on the train is concerned that is only going to be France involved.  But what it does do is put the fear of God into people about what can happen within the territories, the 25 countries of Europe that virtually have no borders any more. You can freely transit between countries without being detected.  We will see a meeting about the interior ministers about what they can do to patrol the suspects who are coming on to the radar all over Europe and stop them from acting."
    },
    {
      "speaker": "BARNETT",
      "text": "Yes, certainly improvements need to be made.  Jim Bittermann reporting live for us from Paris this morning.  Jim, thanks \n Rosemary."
    },
    {
      "speaker": "CHURCH",
      "text": "Russia's largest air show is underway outside of Moscow and it's serving a dual purpose.  There have been diplomatic talks between Vladimir Putin and the king of Jordan and the crown prince of Abu Dhabi on the conflict in Syria and it's a marketplace for Russian weaponry. Matthew Chance joins us from Moscow with that.  And the big message is clear, isn't it?  Russia is no longer isolated with significant deals in the making.  Who has already signed on the dotted line?"
    },
    {
      "speaker": "MATTHEW CHANCE, CNN SENIOR INTERNATIONAL CORRESPONDENT",
      "text": "Those deals are still being brokered now.  This air show and arms fair outside of Moscow takes place until the end of the week.  And throughout that period there will be major deals being done. But I think as you referred to in that introduction it's not just about weapon sales, it's about diplomacy as well.  Russia is playing a more active role in diplomacy, the crown prince of Abu Dhabi and the king of Jordan standing side by side with Vladimir Putin as he opened the air show. As he opened the show with a potential to sell weapons, yes, it's about diplomacy but as you mentioned, it's also about selling weapons as well."
    },
    {
      "speaker": "CHANCE",
      "text": "The awesome spectacle of Russian air power tearing through skies.  This is the kremlin's cutting-edge weaponry on display and on sale.  It's most high-profile arms fair.  War planes like these are among Russia's most lucrative exports and interest seems high.  Delegates from more than 20 countries attended the opening, evidence from the kremlin they are not isolated. VLADIMIR PUTIN, RUSSIAN PRESIDENT (through translator"
    },
    {
      "speaker": ")",
      "text": "I'm convinced regardless of the current political environment this international aviation and space salon will serve as a venue to find new partners."
    },
    {
      "speaker": "CHANCE",
      "text": "Potential new partners from states in the Middle East like Abu Dhabi and Jordan where Russia doesn't traditionally sell arms. The Egyptian president is also visiting Moscow as is the king of Saudi Arabia in what could herald significant deals with Russia. (on camera"
    },
    {
      "speaker": ")",
      "text": "There is a lot of interest in this helicopter, the KA- 52-k and it has been developed to go on board amphibious assault ships that were commissioned from France that deal never went through because of the sanctions with Russia over Ukraine.  Now there is word that Saudi Arabia may be interested in buying those aircraft carriers from France and these helicopters from Russia."
    },
    {
      "speaker": "",
      "text": "But by far the most controversial deal is with the Iranians, finalizing the purchase of S-300 surface-to-air missiles to shield its nuclear facilities.  We ran into the delegation at the missile pavilion. (on camera"
    },
    {
      "speaker": ")",
      "text": "Are you signing this deal for the S300s today?"
    },
    {
      "speaker": "UNIDENTIFIED MALE",
      "text": "We are considering and then we want to decide."
    },
    {
      "speaker": "CHANCE",
      "text": "You haven't decided yet?"
    },
    {
      "speaker": "UNIDENTIFIED MALE",
      "text": "Yes."
    },
    {
      "speaker": "CHANCE",
      "text": "Negotiations may be underway, but the coming days could see Russia arms deals go sky high."
    },
    {
      "speaker": "CHANCE",
      "text": "The focus of the events is going to be the visit of the Egyptian president, Abdel Fattah El-Sisi.  It's the third time in the past year that President Sisi would have visited Russia.  They will be talking about diplomacy, the situation in Syria, international terrorism and the trade relationship between Russia and Egypt. There's a lot of tourism between the two countries.  But Russia is planning to build Egypt's first nuclear reactor as well.  The two will have a lot to discuss."
    },
    {
      "speaker": "CHURCH",
      "text": "Indeed diplomacy and weapons sales there in Russia.  Matthew Chance following it from all angles from Moscow, many thanks to you."
    },
    {
      "speaker": "BARNETT",
      "text": "I want bring you this development just into CNN, flights at the international airport in Dublin, Ireland have been suspended temporarily due to a fire on the roof of a hangar."
    },
    {
      "speaker": "CHURCH",
      "text": "The Dublin Airport Authority says the fire is in a restricted area separate from passenger facilities and has been contained.  The airport is urging travellers to check the website before heading for their flights and we will bring you any further information on this as we get it here at CNN."
    },
    {
      "speaker": "BARNETT",
      "text": "Now one of the world's most famous white sand beaches is not looking so good at this moment.  We'll tell you more about what shut down this part of paradise.  Stay with us."
    },
    {
      "speaker": "CHURCH",
      "text": "Redboy.com is the world's largest male escort site, but U.S. authorities say it's actually an internet brothel and they have charged seven people with promoting prostitution."
    },
    {
      "speaker": "BARNETT",
      "text": "Federal authorities gathered boxes of documents and computer evidence from the company's New York office on Tuesday.  The CEO and six employees were arraigned in federal district court.  The CEO denies any wrongdoing and says his company does not promote prostitution."
    },
    {
      "speaker": "CHURCH",
      "text": "The world famous white sands of one of Hawaii's most popular beaches are off limits right now."
    },
    {
      "speaker": "BARNETT",
      "text": "Unusually heavy rainfall overwhelmed the sewer system in Waikiki.  It caused 1.9 million liters of raw sewage to flow from city manholes into the capital and then spilling on into the ocean."
    },
    {
      "speaker": "CHURCH",
      "text": "City officials closed down beach and warned beach goers to stay out of the water.  It kept away some tourists and shut down nearby businesses.  Our meteorologist, Pedram Javaheri, joins us now to talk about the ramifications for swimmers who didn't take the advice."
    },
    {
      "speaker": "JAVAHERI",
      "text": "There were a few dozen reports that were unaware of what was going on in that general area and the raw sewage, when you think about raw sewage, over 100 viruses that could be contained and detected in the waters there. Any as far as polio, Hepatitis A, worms that can multiply inside your body.  This has happened before and we have seen fatalities from it. We'll talk about what happened and what led to this because Errol telling you the tremendous amount of rainfall that came down. Hawaii's land area as far as Honolulu the city, about 68 square miles with the 3 1/2 inches of rainfall it is 4.5 billion gallons of rainfall pouring over the city, roughly the amount that pours over Niagara Falls in two hours. But storms near the islands we have moisture from Loke and Atsani. They hitch a ride on the upper and mid-level steering currents of the matter and it pushes up to the northwestern corner of the U.S. and heavy rainfall, 4 to 6 inches on the western side of Washington and portions of British Columbia and Idaho and Oregon. You take a look.  We know the air quality is extremely poor.  My family in Washington State telling me the moon at nighttime is orange from the glow in the Seattle region. And notice the temperature trend?  Into the 80s for a couple more days, the 48th time that Seattle hits 80 degrees this summer will happen on Wednesday afternoon.  But a shot of reality from Friday through Tuesday, the first time since the first week of spring that the city of Seattle can get up to four days of rainfall. Beneficial for the drought and fantastic for the firefighters as well and rain in the Caribbean in the upcoming couple days.  The mid-70s around the tropical storm eventually the low 80s.  You are talking about development. The mid-80s rapid development possible over the Turks and Caicos and Bahamas and the forecast track brings the storm to a category 1 hurricane towards southeastern Florida and Miami Sunday into Monday."
    },
    {
      "speaker": "CHURCH",
      "text": "Dear.  Thank you for the head's up."
    },
    {
      "speaker": "BARNETT",
      "text": "A 12-year-old boy stumbles his way through a museum, has a drink in his hand and gets near a 350-year-old painting."
    },
    {
      "speaker": "CHURCH",
      "text": "It's a recipe for disaster."
    },
    {
      "speaker": "BARNETT",
      "text": "We'll show it to you after this."
    },
    {
      "speaker": "CHURCH",
      "text": "Dear, a museum curator's nightmare, a little visitor accidentally knocking over a valuable piece of art."
    },
    {
      "speaker": "BARNETT",
      "text": "In this case, a young boy losing his balance and tripping into a painting worth $1.5 million.  Robyn Curnow has more on this clumsy and costly blunder."
    },
    {
      "speaker": "ROBYN CURNOW, CNN CORRESPONDENT",
      "text": "It's the kind of pre- teen blunder that makes any parent cringe.  A 12-year-old boy in a Taipei art exhibition, loses his balance, stumbles over a rope barrier and ends up tearing a hole in a 17th century masterpiece. His clumsy mishap caught on surveillance camera and now seen across the internet.  The painting is 350 years old and experts say it's worth $1.5 million.  Luckily for the boy, organizers are not asking the boy's family to pay for the restoration. UNIDENTIFIED MALE (through translator"
    },
    {
      "speaker": ")",
      "text": "It's obvious he did not mean to push the painting.  He accidentally stepped on the platform and had a bit of a fall."
    },
    {
      "speaker": "CURNOW",
      "text": "The accident happened Sunday and left a hole the size of a fist in the canvas.  Art experts in Taiwan have already started repairs. UNIDENTIFIED MALE (through translator"
    },
    {
      "speaker": ")",
      "text": "We will enhance the canvas of the painting and mending the part torn on the backside and restore the paint on the front side."
    },
    {
      "speaker": "CURNOW",
      "text": "The oil painting is insured and is due to be shipped back to Italy later this week for further repairs before being returned to its owner.  And despite the damage, they have no plans to move the paintings further away from the public, calling this a one-time accident.  Robyn Curnow, CNN."
    },
    {
      "speaker": "BARNETT",
      "text": "Poor kid."
    },
    {
      "speaker": "CHURCH",
      "text": "You have to feel bad for him.  I hope social media don't make it worse for him."
    },
    {
      "speaker": "BARNETT",
      "text": "Honest mistake there. Here's a lesson on why you want to finish strong.  An early celebration cost one runner her place in the winner circle.  American, Molly Huddle was on her way to a bronze medal.  Look closely at what happened at the finish line."
    },
    {
      "speaker": "CHURCH",
      "text": "With a few paces to go, Huddle raised her arms in victory and her teammate passed her."
    },
    {
      "speaker": "BARNETT",
      "text": "What happened?"
    },
    {
      "speaker": "CHURCH",
      "text": "Huddle said her teammate had more momentum and it will take a long time to get over this."
    },
    {
      "speaker": "BARNETT",
      "text": "It's a crucial lesson, 10,000 meters.  That last meter counts just as much."
    },
    {
      "speaker": "CHURCH",
      "text": "You have to push it to the end."
    },
    {
      "speaker": "BARNETT",
      "text": "As we do on this program every day.  We try."
    },
    {
      "speaker": "CHURCH",
      "text": "We made it."
    },
    {
      "speaker": "BARNETT",
      "text": "Just barely.  You've been watching CNN NEWSROOM.  I'm Errol Barnett."
    },
    {
      "speaker": "CHURCH",
      "text": "I'm Rosemary Church.  \"EARLY START\" is next for our viewers in the United States."
    },
    {
      "speaker": "BARNETT",
      "text": "And for the rest of you there's another edition of CNN NEWSROOM next.  Have a great day."
    }
  ]
}