{
  "show_name": "THE SITUATION ROOM",
  "show_title": "Reporter, Photographer Shot and Killed on Air; Gunman Faxed Manifesto to TV Network after Shootings; Joe Biden Talks to Top Democrats in Emotional Call; Donald Trump Lashes Out on Twitter. Aired 5-6p ET",
  "candidates_mentioned": [
    "sanders",
    "clinton",
    "trump"
  ],
  "candidates_quoted": [
    "sanders"
  ],
  "quotes": [
    {
      "speaker": "UNIDENTIFIED MALE",
      "text": "... from this incident, the shooting, died at Fairfax Inova Hospital in Northern Virginia, as a result of a self- inflicted gunshot wound."
    },
    {
      "speaker": "PAMELA BROWN, CNN CORRESPONDENT",
      "text": "And authorities right now are not saying how Flanagan knew where to find the reporter or photographer, but they did do a live shot an hour earlier, so it's possible, Wolf, that he saw that and tracked them down at that location."
    },
    {
      "speaker": "BLITZER",
      "text": "What a horrific situation, Pamela.  Thanks very much.   It's been an extraordinarily difficult day for the staff of our CNN affiliate WDBJ-TV, two of their beloved co-workers gunned down on the air as viewers watched.   Here's what I want to do.  I want to take a closer look at this evening newscast, which has just started.  Watch this."
    },
    {
      "speaker": "UNIDENTIFIED FEMALE",
      "text": "... Melissa.  It all started early this morning, Alison and Adam were at Smith Mountain Lake, talking with Vicki Gardner for the lake's upcoming 50th anniversary.  That's when the suspect, Vester Lee Flanagan, also known as Bryce Williams when he was on air here at WDBJ-7 a few years ago, started shooting at them.   Police say a 911 call came in around 6:35 a.m. about the shooting. The scene was secured, and they started searching for the suspect in the Smith Mountain Lake area.   Then at 11 this morning, Roanoke City Police found Flanagan's 2009 Ford Mustang at the Roanoke-Blacksburg Regional Airport.  That car has been taken in as evidence.   And we're told Flanagan rented a car earlier this month, a Chevy Sonic, and started traveling up Interstate 81 after the shooting. Now, investigators notified all agencies to be on the lookout for that car.   A license plate reader caught Flanagan's plates on I-66.  A Virginia State Police officer then followed him.  When backup arrived, the officer tried to pull him over, but he ran off the road.   Flanagan was found inside the car and had shot himself.  He died around 1:30 at Inova Fairfax Hospital.  Now police are trying to figure out why this happened."
    },
    {
      "speaker": "UNIDENTIFIED MALE",
      "text": "Right now there's not been a motive per se.  Many of you have gotten a lot of the correspondence, e-mails that had been sent out.  It's obvious that there was \n this gentleman was disturbed in some way, the way things had transpired at some point in his life. It would appear things were spiraling out of control."
    },
    {
      "speaker": "UNIDENTIFIED FEMALE",
      "text": "Flanagan did send a lengthy multi-page fax to a national news organization in New York about the incident.  And they are using that in their investigation, as well.   Now, the other person shot, Vicki Gardner, is in stable with non-life- threatening injuries."
    },
    {
      "speaker": "UNIDENTIFIED FEMALE",
      "text": "Amanda, thank you.   OK.  Joining us now is our WDBJ-7 news director Kelly Zuber.   Kelly, we want you to talk a little bit about what Alison and Adam really meant to all of us here as well as our viewers.   KELLY ZUBER, WDBJ-7"
    },
    {
      "speaker": "NEWS DIRECTOR",
      "text": "I would say Alison and Adam were the A-team.  They came in in the a.m., in the mornings, which is a tough shift.  And they were out all over our viewing area.  I always said to the morning crew, be more awake than your viewers.  And there's no doubt about it, they were more awake.  They came in here. They talked to Leo Hershbrenner  and high-fived with him asking what the weather was.  They were out in the field doing just terrific work.  They were the bright shining young faces that we got to see in the morning.   And while you didn't see Adam, because he was behind the camera, he was one photographer that was very, very involved.  Alison just stepped up to do all kinds of things with us.  She just finished the child abuse special.  Adam was looking forward to beginning a \"Friday Football Extra\" this week.  He was big on high school football.  Even his dad was involved.  His dad came in and worked with us on Friday nights for \"Friday Football Extra.\"  These were two beautiful, incredible people just cut down at the beginning of their lives."
    },
    {
      "speaker": "UNIDENTIFIED FEMALE",
      "text": "Our hearts go out to their families, Adam from Salem, and Alison from Martinsville.  So two young people with families here in this area.  So our hearts go out to all of their family and friends.   Kelly, tell us a little bit more about this \n getting back to Flanagan.  Apparently, this document that was sent to a national news organization, you had some new information on that?"
    },
    {
      "speaker": "ZUBER",
      "text": "Well, we're just getting bits and pieces.  That is obviously part of the investigation, but he sent a 23-page document to ABC several hours before the shooting this morning.  What we're understanding is that he referenced the Charleston shootings as a trigger.  He also mentioned the Virginia Tech shootings.  He mentioned the Columbine shootings.   And the quote that I saw from it was: \"The church shooting was the tipping point, but my anger has been building steadily.  I've been a human powder-keg for a while, just waiting to go boom.\""
    },
    {
      "speaker": "UNIDENTIFIED FEMALE",
      "text": "Wow.  Tough words to hear.  Kelly, thank you for being here today and saying those kind words about Adam and Alison. We appreciate that."
    },
    {
      "speaker": "JEAN JADHON, WDBJ ANCHOR",
      "text": "Alison Parker and Adam Ward were not beginners, but they were at the beginning of their careers.  And both of them had big plans, personally and professionally.  WDBJ Joe Dashiell is here with a closer look at their lives \n Joe."
    },
    {
      "speaker": "JOE DASHIELL, WDBJ",
      "text": "Jean, Alison and Adam were special people.  And while this has been a supremely sad day for all of us, we've also been thinking about their special talents.   Alison was smart, dedicated to her work.  She had it all together. Adam was a capable photographer who would go the extra mile to get the job done.  Extremely polite, he always said \"Yes, ma'am\" and \"sir,\" even after he considered you a friend.  And the two of them had a lot in common."
    },
    {
      "speaker": "DASHIELL",
      "text": "They worked together every morning.  Both Alison Parker and Adam Ward were natives of this area."
    },
    {
      "speaker": "ALISON PARKER, WDBJ REPORTER",
      "text": "Hey, everyone, I'm Alison Parker. Photojournalist Adam Ward and I are putting the final touches on our special report for tonight."
    },
    {
      "speaker": "DASHIELL",
      "text": "Alison grew up in Martinsville, Adam in Salem.  Alison was a graduate of Martinsville High School and James Madison University. She loved the outdoors.  Adam attended Salem High School, where he played football.  He was a Virginia Tech graduate and a huge Hokies fan.  And both of them worked here as interns at WDBJ-7 before they signed on as employees."
    },
    {
      "speaker": "ADAM WARD, WDBJ PHOTOJOURNALIST",
      "text": "Adam Ward, News 7 Sports."
    },
    {
      "speaker": "DASHIELL",
      "text": "Alison worked at a station in Jacksonville, North Carolina, before she returned to WDBJ-7 in 2014.  Adam had been here for four years, first as an employee of our production department, and more recently as a photographer in news.   He and Alison had been working together on WDBJ-7 morning a little over a year, covering everything from community events to breaking news, and they did it well."
    },
    {
      "speaker": "WARD",
      "text": "And I have to bring him out.  Adam, come out from in front of the camera.  He is the ugly stepmother and just looking absolutely gorgeous in this costume.  How do you feel right now?"
    },
    {
      "speaker": "WARD",
      "text": "Well, when I first put the heels on, I rolled an ankle.  But we're good since then.  You know, it's respect.  It's very form- fitting, I'll say."
    },
    {
      "speaker": "DASHIELL",
      "text": "And both of them found love here at WDBJ-7.  Adam was engaged to our morning producer, Melissa Ott.  This was her last day at WDBJ-7 before moving to a new job in Charlotte.  And they were planning their wedding.   Alison and our 6 p.m. anchor, Chris Hurst, were dating.  They had moved in together, Chris told me this afternoon, to save money for a ring.  I sat down with Chris a short time ago, and he spoke from the heart about Alison and Adam.  We'll hear from him coming up at 6 p.m."
    },
    {
      "speaker": "JADHON",
      "text": "Oh, Joe."
    },
    {
      "speaker": "BLITZER",
      "text": "All right.  So there's a little flavor of what's going on, WDBJ, our local affiliate reporting on the horrific news that unfolded there earlier this morning.   The general manager at WDBJ, Jeff Marks, is joining us now from Roanoke.  Jeff, first of all, thanks very much for joining us.  Our hearts go out to you, to everyone else, all of the friends and family of Adam and Alison.  First of all, how are you doing?"
    },
    {
      "speaker": "JEFF MARKS, GENERAL MANAGER, WDBJ",
      "text": "Well, I'm doing OK, because we're all running on adrenaline.  But more importantly it's how my team is doing.  And they're holding up remarkably well.  A lot of emotion and a lot of grief, but they have a job to do."
    },
    {
      "speaker": "BLITZER",
      "text": "How should Alison and Adam be remembered?"
    },
    {
      "speaker": "MARKS",
      "text": "They're terrific people.  They were exuberant, energetic. They were pros.  And you know, we \n you expect to hear me say that. In this case, it has the added value of being true.  They were just wonderfully forward people who would do anything that was asked of them and more.  And I can't imagine if you hand-picked out of a million people two folks to have in your newsroom, that you wouldn't have picked Alison Parker and Adam Ward."
    },
    {
      "speaker": "BLITZER",
      "text": "You knew they were special even while they were working as interns for your station, right?"
    },
    {
      "speaker": "MARKS",
      "text": "Yes.  They grew from the moment they walked in the door. Alison took a hiatus at another TV station at a smaller market, and then came back.  Adam moved up in the business from our production department to our news department, shooting, which he really loved doing.  And they were just \n they were open to coaching.  They were open to any new adventure, and we just loved having them around."
    },
    {
      "speaker": "BLITZER",
      "text": "Why do you think this Vester Flanagan, the killer, actually went out there and shot these two beautiful young people?"
    },
    {
      "speaker": "MARKS",
      "text": "You know, Wolf, we \n I tell reporters, they know two things.  They know what people say, and they know what people do.  We don't know what people think.  We're not mind readers.   And all I have to say is I'm not focused on him today.  I know he had some issues when he was an employee here.  I know he had anger.  But I'm just not focusing on his story.  And I'm not trying to avoid it. It's just we have bigger fish to fry right now, and that's the well- being of our people and the families of our loved ones."
    },
    {
      "speaker": "BLITZER",
      "text": "Jeff Marks, the general manager of WDBJ, our hearts go out to you, go out to the entire community, all the friends and family of these two wonderful young people.  Alison Parker, only 24 years old, Adam Ward only 27 years old.   Much more on the breaking news coverage when we come back."
    },
    {
      "speaker": "BLITZER",
      "text": "Our breaking news, two beloved employees of a TV station in southern Virginia are murdered during a live news interview as viewers watch in horror.  The gunman shoots himself after a police stop and after posting grisly images on social media and sending out a long manifesto. We're now learning how police tracked down the gunman.  Brian Todd is at the scene of these murders.  He's joining us now from southern Virginia.   What is the latest, Brian?  What are you learning?"
    },
    {
      "speaker": "BRIAN TODD, CNN CORRESPONDENT",
      "text": "Wolf, we'll set the scene for you here in Moneta, Virginia.  This is the Bridgewater Plaza Shopping Center behind me, the scene of the shooting.  You can still see a very heavy police presence, sheriff's deputies there, police investigators on the scene, investigators looking at how the shooter, Vester Flanagan, knew those two journalists were going to be in this parking lot early this morning.  They're still following that thread of the investigation.   What we're told tonight is that they cell phone.  They used his cell phone, rather, to track his whereabouts after he left this location to find out where he was heading.  We're told that he headed to an airport.  He ditched his car there.  He picked up another car that he then took up Interstate 81 to Route 66 toward Washington, but he didn't get that far.   He still drove, Wolf, almost 200 miles before police caught up to him. They tried to stop his vehicle.  According to authorities, he refused to stop.  His vehicle then rein off the road.  It was at that time that they observed that he had a self-inflicted gunshot wound.  He died of that wound less than four hours ago in Fairfax Hospital in Northern Virginia, Wolf.   Also tonight, some investigative threads that we're picking up on the shooter's background.  I spoke with two people who worked with him at two TV stations.  One was WTOC-TV in Savannah, Georgia, where he worked in the late '90s.  One was here in WDBJ-TV in Roanoke.   The employee, the former employee of WDBJ told me that he was a hard person to work with, that he had run-ins with other employees.  That on the day that he was fired in early 2013, he apparently would not leave on his own.  That they had to call the police in, and newsroom staff actually had to evacuate the newsroom while they dealt with that situation.  We're told he was fired for performance-related issues, and that he had had run-ins with other employees. The former employee at WTOC-TV in Savannah, Georgia, where Vester Flanagan worked as the late '90s as he was just starting out his TV career as a reporter, told me that he was kind of odd in his behavior, that he was a struggling reporter for the first \n for about the year that this person worked with him, and that he often made people feel uncomfortable.   We also know, Wolf, that in the year 2000, he filed a lawsuit with another station that he worked at, WTWC in Tallahassee, Florida.  And there were racist-related allegations in that lawsuit.  He accused a producer and upper-level management of that station of calling him a monkey.  He said there were other racist incidents directed toward him.  That lawsuit, Wolf, was settled out of court."
    },
    {
      "speaker": "BLITZER",
      "text": "Brian, we're going to get back to you.  Thanks very much. I want to bring in our senior investigative reporter, Drew Griffin, who's also learning additional information about this gunman.  What are you finding out?"
    },
    {
      "speaker": "DREW GRIFFIN, CNN SENIOR INVESTIGATIVE CORRESPONDENT",
      "text": "He had a short career at this station, Wolf, but a long history at that station, documented of problems that he was having in which he made his other colleagues feel threatened or uncomfortable.   The station, in memos that we have uncovered at one point made him, forced him to go into some kind of counseling to deal with his anger issues.  All of this comes from a lawsuit in which this shooter filed upon his termination from WDBJ, again alleging racial discrimination and workplace harassment, but that lawsuit was dismissed.   But in it and in the discovery that we just uncovered, there is a lot of information about how hard this guy was to work with.  The photographers talking about tussling with him almost on a daily basis. He was called in several times and reprimanded for poor journalism, according to the station manager. And let me just tell you about the day that he was fired, which was February 1, 2013.  Apparently, he told the person who fired him, \"I'm not leaving.  You're going to have to call the blanking police.  Call the police.  I'm not leaving.\"   Another person says that he got so violent that, when he slammed the door and went out the newsroom, this caused members of the sales team to take shelter in a locked office.  It was after that episode that has been described to us as a tantrum, that the police were, in fact, called and had to escort this suspect out of the building. So there was a long, long history of problems at WDBJ in just the year that he worked there, Wolf."
    },
    {
      "speaker": "BLITZER",
      "text": "Shocking information.  I know you're getting more information.  I'm going to get back to you, and get back to Brian. Stand by.   We're also getting new information on when he decided to go ahead and purchase the guns, apparently two days after that massacre at that predominantly African-American church in Charleston, South Carolina.   Much more right after this."
    },
    {
      "speaker": "BLITZER",
      "text": "Live pictures coming in just outside the TV station WDBJ-TV in Roanoke, Virginia, where people are laying flowers in memory of two young journalists, Alison Parker, 24 years old, and Adam Ward, 27 years old, murdered on television live earlier this morning.   We're continuing to follow the breaking news.  This young reporter, this young cameraman, murdered as they interviewed an individual who also was shot, and in stable condition.   Police say the gunman, himself a former TV reporter, shot himself during a police chase, died at a hospital a few hours later.  Before that, the gunman posted very gruesome images of the shooting online, sent out a rambling manifesto, attempting to explain his actions.   Our justice reporter, Evan Perez, is working his sources for us.  What do we know specifically about this so-called manifesto?"
    },
    {
      "speaker": "EVAN PEREZ, CNN JUSTICE CORRESPONDENT",
      "text": "Wolf, he sent this rambling manifesto, 23 pages in all, to ABC News.  They received it this morning.  It was a rambling letter in which he describes being a human powder keg and angry about racial grievances and being sexually harassed over the years.   The letter is believed to be from this \n from the gunman, Vesper Flanagan, who went by the name Bryce Williams.  And it arrived by fax at 8:26 this morning at the ABC newsroom.  And it says in part \n we have a couple pieces that we will show on air, on the screen right now.   One part says, \"Yes, it will sound like I am angry.  I am.  I have every right to be.  But when I leave this earth, the only emotion I want to feel is peace.\"   And in this letter, Wolf, the letter writer goes on to describe admiration for previous mass shooters, including the shooter in the Virginia Tech shooting, the one at Columbine High School.   Another part of the letter we wanted to highlight is where he describes what really drove him to this.  He says the Charleston shooting, that \n a racist that killed nine people in a Charleston church, was part of that.   He says, quote, \"The church shooting was a tipping point, but my anger has been building steadily.  I've been a human powder keg for a while, just waiting to go boom.\"   And in recent weeks, Wolf, somebody had been calling the ABC newsroom, asking for the fax number.  This morning, they got the fax at 8:26. At about 10 a.m., they got another call, someone identifying themselves as Bryce, and saying that he had shot two people and that police were looking for him."
    },
    {
      "speaker": "BLITZER",
      "text": "And you say he felt sexually harassed?  Is that what you're saying?"
    },
    {
      "speaker": "PEREZ",
      "text": "That's right.  He said that he felt that he was being harassed because he was gay.  He felt that he was being harassed because he was African-American.  None of those things is \n are things that his co- workers said they ever noticed.   He bought the gun just two days after the Charleston shooting."
    },
    {
      "speaker": "BLITZER",
      "text": "All right.  Evan, stand by.   The community in Roanoke, Virginia, clearly in shock.  The community mourning tonight.  I want to go to our own Chris Cuomo.  He's now on the scene for us in Roanoke.  Chris, you're getting new information, as well.  What are you learning?"
    },
    {
      "speaker": "CHRIS CUOMO, CNN ANCHOR",
      "text": "I am.  I just want to show you where we are. This is the memorial here that's been set up.  You see the two black ribbons, obviously for Alison and Adam.  There are flowers, there are balloons. But there's something else going on here.  These people were very young, but they touched a lot of lives, Wolf.  This community has been coming out and telling stories about these two people and how they had met them in the community and how much they thought of them.   So hopefully, that gives some solace to their families, that while they had so much of their lives taken from them, they did so much with the time that they did have.   As for the man who took those lives, literally executed those two people while they were doing what they love, there is an emerging picture of him as being disturbed.  His motivation certainly isn't justification, and certainly, there's no reason to believe there was any righteousness attached to his madness. But there is a picture of him being disturbed and not really in control of his behavior and his anger.  To that point, someone posted on YouTube \n they felt it could be helpful \n that there is a video of a road rage incident, as it's described by this person.  You may want to start rolling it now.  There is some profanity.  We suggest you pot down the sound for that. But the person who posted the video says, Wolf, that they called him  out, called out the murderer, the eventual murderer for his behavior on July 6, 2015, so not long ago.  Because he was driving like a maniac.   The person then followed this other driver into a parking lot, where this altercation ensued, where there was basically just a lot of language being used back and forth.  But this new video is giving more fuel to the fire, showing the instability, the rage that was in this person, and the inability to control themselves.  And obviously, that all wound up motivating the worst of their behavior, taking the lives of these two people. And as for the expression in his manifesto, as it's being called, that he wanted to leave with peace, he certainly couldn't have had that, Wolf.  And that's why he tried to take his own life."
    },
    {
      "speaker": "BLITZER",
      "text": "And we did confirm that this is, in fact, the same person, Vester Flanagan, also known as Bryce Williams, by confirming the license plate number in this video, showing this road rage.   The folks over there, Chris, in Roanoke and the community, they must really be in shock, based on what's going on right now.  Give us a little flavor of what you felt since you got there."
    },
    {
      "speaker": "CUOMO",
      "text": "Well, look, Roanoke, like so many places in America, is a tight-knit small community.  They refer to WDBJ as their news family. So many have come here wanting to just give what they can.  And it is one of the beautiful expressions that we see that is often born of the worst in human experience, where they're coming out here; they're asking why.   Of course, there's no good answer.  It's a question you've asked so many times in too many situations, Wolf.  They're familiar questions about why this man's upset, why his battle with himself turned into violence towards others.  But one thing that is also balancing that out here in a very big way is the love that people have for these families. Remember: they weren't just young.  They were just starting their lives, Wolf, not just as journalists.  Alison was looking forward to \n she had found the man that she loved.  They were living together now, another anchor here, Chris Hurst.  Adam was going to get married.  His fiancee had to watch this live shot from the control room.   They were just starting their lives in so many ways.  Everything about it is so wrong, but the people here are trying to do what they can to show love, and obviously, that expression goes first to the families, but also what they're calling the news family, the folks in the building behind us doing the job the right way every day."
    },
    {
      "speaker": "BLITZER",
      "text": "Chris, we're going to get back to you.  Our hearts go out to the families and friends of Alison Parker and Adam Ward. Let's not forget Vicki Gardner, a local chamber of commerce director. She was shot in the back.  She's listed now in stable condition.  We hope she makes a full recovery.   Coming up, the gunman's allegations of racism in the lawsuit he filed against a previous employer.  We're learning new details.   And the slain reporter, Alison Parker, in her own words, talking about herself and her ambitions."
    },
    {
      "speaker": "BLITZER",
      "text": "Back to our breaking news: the murders of the two young journalists during a live TV broadcast.   Let's bring in our law enforcement analyst, Tom Fuentes, a former FBI assistant director.  Also joining us the former ATF executive Matthew Morris.  He's now senior vice president of FJC Security Services. Also joining us, Jeff Gardere.  He's a psychologist, professor of behavior medicine, Arturo College in New York."
    },
    {
      "speaker": "FOREMAN",
      "text": "Jeff, let's talk a little bit about this guy, Flanagan.  He filmed the shooting, and then he actually tweeted about it.  As he was being chased, he was basically broadcasting everything he was doing. How does this fit into the profile of a killer?"
    },
    {
      "speaker": "JEFF GARDERE, CLINICAL PSYCHOLOGIST",
      "text": "Well, I think Tom will tell you, here we go yet again.  This is sort of like a copycat killer.  Wants to make a very strong message, wants to do it in a different way, and wants to, you know, upmanship up the individuals from perhaps the Virginia Tech, Columbine High School shootings, and he wants to do it in a different way.  He wants to do it better.  But it's all about rage, anger, delusional, paranoid, making that statement."
    },
    {
      "speaker": "BLITZER",
      "text": "You know, Tom, according to ABC in this manifesto, he says he actually put down a deposit to buy a gun two \n to buy a gun two days after the Charleston church massacre at this predominantly African-American church, saying that sent him over the top.  Does that speak to his mind?"
    },
    {
      "speaker": "TOM FUENTES, CNN LAW ENFORCEMENT ANALYST",
      "text": "I think a little bit it speaks to his mind, but there's more complexity to that.  And I think, you know, the extreme narcissism, that he's going to go out, not just in a blaze of glory but he's going to film it, he's going to put it out.  Make maximum use of mainstream media, social media, even sending a fax, old-time media.  That, you know, he wanted to be out there; he wanted to be talked about like we're doing and achieve fame.  And pick on these two people in particular to do it.   And I think that's the \n that's the part of this that's difficult to understand, is he didn't just take this out in general like the North Charleston type shootings or the other shootings in Charleston.  But he's taking it out, pointed at those two, the reporter and the cameraman, in particular.  And I think that's what's a little bit different than some of these other shootings."
    },
    {
      "speaker": "BLITZER",
      "text": "What do you think, Matthew?  What would have motivated  Flanagan to actually write a detailed manifesto and fax it to ABC News?"
    },
    {
      "speaker": "MATTHEW MORRIS, FORMER ATF EXECUTIVE",
      "text": "Well, you know, Wolf, no one knows what goes into the mind of a madman.  Certainly, this manifesto is not unlike other similar documents that we see from other active shooters.  But you know, time is going to tell, as to what was pushing him over the edge. But there were clear signs along the way that he was on the way to this kind of explosion, but there weren't enough people in one place to be able to tell at the same time."
    },
    {
      "speaker": "BLITZER",
      "text": "Jeff, in the manifesto this morning to ABC, Williams said \n and I'm quoting now \n \"My hollow-point bullets have the victims' \n hollow-point bullets have the victims' initials on them.\"  Take us inside his mind.  What does that say to you, the message he's trying to send?"
    },
    {
      "speaker": "GARDERE",
      "text": "Well, my understanding is those initials may be the victims of the actual church shooting.   But he also says, Wolf, \"Hey, this isn't just about these people dying in the church, being massacred.  It was just the tipping point.\"  This is an individual who was a powder keg.  He admits it.  He feels that he had been discriminated and had been a victim in the past couple of years.   And I think what we really need to find out here is what has been going on with him for the past two years, since he's been at this particular television station as an employee?  Who are the family? Who are the friends?   I think that kind of information, the triangulation of information, will tell us more about this very mentally disturbed, rageful, narcissistic individual."
    },
    {
      "speaker": "BLITZER",
      "text": "Yes.  In this ABC-released manifesto that was faxed to them, he says he suffered racial discrimination, sexual harassment, bullying at work.  He says he was attacked by black men and white females.  He talks about how he was attacked for being a gay black man.  All right.  We're going to have much more on what was going on.  But we also want to show you something else, something very, very different.  A promotional video that Alison Parker, 24-year-old young journalist, made for her station, talking about herself and her ambitions.  Watch this."
    },
    {
      "speaker": "ALISON PARKER, JOURNALIST KILLED ON AIR",
      "text": "Something viewers might not know about me is that I come from a family that absolutely loves the arts.  My mom works at Piedmont Arts in Martinsville.  My dad was on Broadway back in the day, and I played trumpet and French horn in high school, and continue to go and support community theater events throughout our region.  I think it's something that's very, very important, and I will always support it."
    },
    {
      "speaker": "GRAPHIC",
      "text": "When you were young, what did you want to be when you grew  up?"
    },
    {
      "speaker": "PARKER",
      "text": "When I was younger, I was really interested in the math and science fields.  Those were always my bust subjects in school, but I went the journalism route, which is OK, but when I was younger, I wanted to either become a doctor or become a pharmacist.  But as a journalist, I get to cover those types of fields, so it's close enough."
    },
    {
      "speaker": "BLITZER",
      "text": "All of us here at CNN send our deeper condolences to the families, friends and colleagues of Alison Parker and Adam Ward.   More breaking news coming up.  We're also learning new information about the gunman who killed that TV news crew during that live report.  We also have a very different story: new information about Joe Biden's emotional phone call today with top Democratic Party leaders.  What he revealed about whether he will run for president of the United States."
    },
    {
      "speaker": "BLITZER",
      "text": "We're continuing to follow the breaks news.  The TV news reporter and photographer shot and killed during a live report by a former station employee who later killed himself.   These are live pictures coming in from just outside that TV station in Roanoke, Virginia, where people are coming, they're placing flowers, balloons, others, developments \n they're trying to remember, to remember these two wonderful young journalists.   We're also following other important news, political news, including an emotional phone call today that's fueling new speculation about whether the Vice President Joe Biden will challenge Hillary Clinton for the Democratic presidential nomination.   Our senior White House correspondent Jim Acosta is joining us now.   What are you picking up today, Jim?"
    },
    {
      "speaker": "JIM ACOSTA, CNN SENIOR WHITE HOUSE CORRESPONDENT",
      "text": "Wolf, Vice President Joe Biden was on a conference call with key members of the Democratic Party today.  Biden spoke emotionally about how he's talking with family members, about whether he should run for president and this call is yet another sign Biden wants to stay in the conversation for 2016."
    },
    {
      "speaker": "ACOSTA",
      "text": "Behind closed doors, Vice President Joe Biden held a conference call with Democratic Party leaders, gathered for a summer meeting that's aimed at attracting presidential contenders. During the call Biden revealed he's trying to determine if he has what he called the emotional fuel to run."
    },
    {
      "speaker": "JOE BIDEN, VICE PRESIDENT",
      "text": "If I were to announce to run I have to be  able to commit to all of you that I would be able to give it my whole heart and my whole soul.  And right now both are pretty well banged up.  And we're trying to figure out that issue."
    },
    {
      "speaker": "ACOSTA",
      "text": "The call was billed as an opportunity to hear from Biden on the Iran nuclear deal."
    },
    {
      "speaker": "BIDEN",
      "text": "We have access to any place in the entire country of Iran, regardless of whether it is.  Where we suspect it to be."
    },
    {
      "speaker": "ACOSTA",
      "text": "It was all seen by top Democrats as another sign Biden wants to stay on their radar screen.  The vice president has every reason to hurry up."
    },
    {
      "speaker": "HILLARY CLINTON (D), PRESIDENTIAL CANDIDATE",
      "text": "Vice President Biden is a friend of mine.  He and I were colleagues in the Senate."
    },
    {
      "speaker": "ACOSTA",
      "text": "His on potential competition, Hillary Clinton, is busy building up her operation in Iowa, grabbing a key endorsement from that's state's popular former governor, Tom Vilsack, but she's also sounding more contrite than ever on her use of a personal e-mail account to conduct official business as secretary of state."
    },
    {
      "speaker": "CLINTON",
      "text": "Well, I know people have raised questions about my e-mail use, as secretary of State, and I understand why.  I get it.  So here's what I want American people to know.  My use of personal e-mail was allowed by the State Department.  It clearly wasn't the best choice."
    },
    {
      "speaker": "ACOSTA",
      "text": "A source close to the Clinton campaign tells CNN they are not worried about Biden, they are way more focused on Sanders, but the vice president's allies like the Draft Biden Super PAC says Democratic donors are ready for an alternative."
    },
    {
      "speaker": "STEVE SCHALE, DRAFT BIDEN",
      "text": "I've been surprised by the number of donors who have reached out.  Some of them who are with Hillary Clinton currently, some who are not, and so they want to get involved."
    },
    {
      "speaker": "ACOSTA",
      "text": "Still after losing his son Beau to cancer, Biden may not be prepared for a run.  As one friend told \"Politico,\" he's just not himself.  He's sort of all over the place.  Something the vice president hinted at in that call with the DNC."
    },
    {
      "speaker": "BIDEN",
      "text": "That's the truth of the matter and \n but believe me, I've been giving this a lot of thought and dealing internally in this family about how we do this."
    },
    {
      "speaker": "ACOSTA",
      "text": "Now the White House is doing its best to stay out of the prospect of a messy contest between Joe Biden and Hillary Clinton, saying the president has not weighed who would make the best candidate.  But current and former aides of the president are skeptical Biden can win.  As one told me earlier today, Wolf, they just don't see a path to the  nomination.  And I think the bottom line from this phone call that Biden had with the DNC earlier is he just has not made up his mind yet \n Wolf."
    },
    {
      "speaker": "BLITZER",
      "text": "Clearly that was the indication we got.  Let's see what he does.   All right.  Jim Acosta, thanks very much."
    },
    {
      "speaker": "ACOSTA",
      "text": "You bet."
    },
    {
      "speaker": "BLITZER",
      "text": "The vice president's comments come as Donald Trump also making some new headlines with some Twitter attacks.    Let's get some more on all of the political news.  Joining us now our CNN political commentator S.E. Cupp, our political contributor, the Republican strategist, Kevin Madden and the former Obama senior adviser, our CNN political commentator, Dan Pfeiffer.   Let me ask you, Dan, what you think.  You just heard Jim Acosta's report on the vice president speaking to leaders of the DNC.  Sounding rather emotional."
    },
    {
      "speaker": "DAN PFEIFFER, CNN POLITICAL COMMENTATOR",
      "text": "I think it's important to understand when people normally talk about politicians, they think about how they calculate and focus group every word.  That's not Joe Biden.  He is the most authentic politician I've ever been around. You ask him how he's doing, he's going to tell you how he's doing.   And I think that's what happened there is that he is a just \n he's an incredibly emotional human being, he's in a very emotional point in his life and he was being very honest with these people about the thought process that he's going through.  And it's hard to imagine being in the situation that he and his family are in.  And to be forced to make a decision like this one is going to be incredibly hard.  He didn't hide that, he was totally honest about it."
    },
    {
      "speaker": "BLITZER",
      "text": "Yes.  S.E., let me get your reaction.   S.E."
    },
    {
      "speaker": "CUP, CNN POLITICAL COMMENTATOR",
      "text": "Yes, well, there were a couple of interesting pieces of news today around Biden.  This car was one. The idea that Jim Acosta referred to that some of Hillary's donors might be looking to jump over to Biden is another.  And there's a report in \"Politico\" that Bill Clinton is very, quote, unquote agitated by the hype surrounding a potential Biden bid.   So I think as this mounts, Joe Biden is a nice guy.  I don't think he is looking to make a moment of this.  He is deeply soul searching on this moment and while everyone sort of worries about it, he's I think looking deep inside."
    },
    {
      "speaker": "BLITZER",
      "text": "You agree?"
    },
    {
      "speaker": "KEVIN MADDEN, CNN POLITICAL CONTRIBUTOR",
      "text": "Yes.  I agree.  I think Dan's point is probably the most important, which is that, you know, especially as an Irish man, I know how these other Irish guys feel. They wear these raw emotions on their \n on their sleeves.  And I think he is going through this whole process.  He's not doing it personally, he's doing it \n he's not doing it privately, he's doing it personally with those that are closest with him."
    },
    {
      "speaker": "CUPP",
      "text": "Yes."
    },
    {
      "speaker": "MADDEN",
      "text": "So it will be interesting to see.  I expect that the Clinton campaign, as S.E. said, they're very agitated about this.  They hate this palace intrigue because it rallies the nerves of a lot of their supporters right now.   We went through this, I remember, with Romney where there was always talk about a new person getting in the race.  They'd rather have that person in the race so they can do something about it than have all this palace intrigue from the outside."
    },
    {
      "speaker": "BLITZER",
      "text": "Speaking about palace intrigue, let's talk about Donald Trump for a moment."
    },
    {
      "speaker": "CUPP",
      "text": "OK."
    },
    {
      "speaker": "BLITZER",
      "text": "What's going through his mind, you think as he \n he's got this little war going with Jorge Ramos, anchor from Univision, still a war going on with Megyn Kelly, the anchor from FOX News."
    },
    {
      "speaker": "CUPP",
      "text": "Yes."
    },
    {
      "speaker": "BLITZER",
      "text": "I can understand if you're a conservative Republican going to war maybe against Univision or some liberal news organization."
    },
    {
      "speaker": "CUPP",
      "text": "Yes."
    },
    {
      "speaker": "BLITZER",
      "text": "May that will help you.  But going to war against FOX News, maybe not."
    },
    {
      "speaker": "CUPP",
      "text": "Well, I think one of the refreshing things about Donald Trump, one of them, is there are no sacred cows for Donald Trump.  I actually like that about him.  I think there are some cows like, say, POWs that should probably remain sacred.  But for Donald Trump he doesn't see these imaginary lines that a lot of conservatives and liberals have drawn around institutions like FOX News or individuals like Megyn Kelly.  He just seized an opportunity.  And you'd think that it would have consequences but it doesn't seem to have consequences for the people who like him."
    },
    {
      "speaker": "BLITZER",
      "text": "How should the other Republican candidates respond to Donald Trump."
    },
    {
      "speaker": "MADDEN",
      "text": "Look, I think S.E. is right.  The amazing thing about this is Donald Trump has figured out that the media covers a couple of things. They cover polls, they cover money, they cover scandals and they cover attacks.  Donald Trump right now is driving the tone and tempo of this whole race because he's the one that's on the attack, he's on offense. These other campaigns, they have to hit back.  I think many of their  strongest supporters are wondering when is my guy going to take this guy on, and start to speak to the anxieties or the \n you know, the needs or wants that I have as a voter.  And I think that's what they have to do.  They have to start getting control of this campaign and start driving their own \n being able to drive their message, get back on offense."
    },
    {
      "speaker": "BLITZER",
      "text": "Do Democrats just watch this from the outside, let the Republicans fight amongst themselves?"
    },
    {
      "speaker": "MADDEN",
      "text": "Yes."
    },
    {
      "speaker": "BLITZER",
      "text": "Or should they get involved and go after Trump?"
    },
    {
      "speaker": "MADDEN",
      "text": "Dan didn't even want to say either?"
    },
    {
      "speaker": "BLITZER",
      "text": "Yes."
    },
    {
      "speaker": "PFEIFFER",
      "text": "I don't want to do anything to upset Donald Trump's chances.  No, I think what Democrats should do is make sure that whoever the Republican nominee, whether it's Donald Trump or someone else, pays the price for how Donald Trump has moved the debate to the right particularly on immigration.  And that everyone should know that Jeb Bush is now \n in order to sort of try to get Donald Trump supporter, using the term anchor baby, that Donald Trump is throwing Jorge Ramos out, I think it's sort of a perfect metaphor for the impact he's had by entering this election.   So let's not get in the way of it, but let's find ways to use it to our advantage to prepare for whoever the nominee is going to be."
    },
    {
      "speaker": "CUPP",
      "text": "But I think it's also given some conservatives a chance that they might not have had to move to the center, at least tonally?  When you have someone like Carly Fiorina coming out and saying, I would not change birth right citizenship, Marco Rubio saying I don't particularly like the term anchor baby, I mean, those are conversations we wouldn't have if not for Trump putting them out there."
    },
    {
      "speaker": "BLITZER",
      "text": "He's certainly spring up.   All right, guys. Thanks very much.  Don't go too far away.   Coming up, more of the breaking news we're following.  A young reporter and photographer murdered on air during a live TV interview, as horrified viewers watch.   The gunman, a former reporter himself, shoots himself, kills himself after posting images of the shootings online, sending out a rambling manifesto, trying to explain his actions.    What made him snap?"
    },
    {
      "speaker": "BLITZER",
      "text": "Happening now, breaking news, murder on live TV.  A gunman kills two journalists in the middle of an interview with viewers watching.  Tonight his trail of blood and anger in a disturbing manifesto, shocking tweets and a gruesome video of the shootings he posted online."
    }
  ]
}